app/Controllers/CarritoController.php

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '11'
---
    public function agregar($idProducto)
    {
        // Obtener el producto desde la base de datos
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($idProducto);

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '9'
UPDATE `productos` SET `cantidad` = 19
WHERE `productos`.`id_producto` IN ('9')
---
    private function restarCantidadProducto($idProducto, $cantidad)
    {
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($idProducto);

        if ($producto) {
            $nuevaCantidad = $producto['cantidad'] - $cantidad;

            // Verificar si la cantidad restante es mayor o igual a 0
            if ($nuevaCantidad >= 0) {
                // Actualizar la cantidad del producto en la base de datos
                $productoModel->update($idProducto, ['cantidad' => $nuevaCantidad]);

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '9'
---
    public function checkout()
    {
        // Obtener los datos del usuario actual
        $userModel = new UserModel();
        $session = session();
        $userId = $session->get('id');
        $usuario = $userModel->find($userId);

        // Verificar si el usuario está autenticado
        if (!$usuario) {
            return redirect()->to(base_url('ingresar'));
        }

        // Obtener el carrito desde la sesión
        $carrito = session()->get('carrito');

        // Verificar si el carrito está vacío
        if (!is_array($carrito)) {
            return redirect()->to(base_url('carrito'));
        }

        // Verificar si hay suficiente stock disponible para los productos en el carrito
        $productoModel = new ProductoModel();
        $insuficienteStock = false;

        foreach ($carrito as $item) {
            $producto = $productoModel->find($item['id_producto']);

SELECT *
FROM `Facturas`
WHERE `Facturas`.`id` = '11'
---
    public function exito($idFactura)
    {
        $facturaModel = new FacturaModel();
        $detalleFacturaModel = new DetalleFacturaModel();

        // Obtener la factura desde la base de datos
        $factura = $facturaModel->find($idFactura);