app/Controllers/ProductosController.php

SELECT *
FROM `productos`
ORDER BY `id_producto` ASC
---
                $data['productos'] = $productos;
            }
        } else {
            $data['productos'] = $productoModel->orderBy('id_producto', 'ASC')->findAll();

SELECT *
FROM `productos`
SELECT *
FROM `categorias`
SELECT *
FROM `categorias`
WHERE `categorias`.`id_categoria` = '1'
---
    public function catalogoIngresado()
    {
        $session = session();
        if (!$session->has('nombre')) {
            return redirect()->to(base_url('ingresar'));
        }

        if ($session->get('logout')) {
            return redirect()->to(base_url('ingresar'));
        }

        $productoModel = new ProductoModel();
        $productos = $productoModel->findAll(); // Obtener todos los productos

        $categoriaModel = new CategoriaModel();
        $categorias = $categoriaModel->findAll(); // Obtener todas las categorías

        // Obtener la categoría de cada producto
        foreach ($productos as &$producto) {
            $categoria = $categoriaModel->find($producto['id_categoria']);