app/Models/DetalleFacturaModel.php

    public function getProducto($idProducto)
    {
        return $this->db->table('Productos')->getWhere(['id_producto' => $idProducto])->getRow();
---
SELECT *
FROM `Productos`
WHERE `id_producto` = '9'