app/Models/FacturaModel.php

    public function getUsuario($idUsuario)
    {
        return $this->db->table('Usuarios')->getWhere(['id' => $idUsuario])->getRow();
---
SELECT *
FROM `Usuarios`
WHERE `id` = '16'

    public function guardarFactura($datos)
    {
        return $this->insert($datos);
---
INSERT INTO `Facturas` (`id_usuario`, `importe_total`, `activo`, `fecha`) VALUES ('16', 151000, 1, '2023-06-13')