app/Views/listarProductos.php

SELECT *
FROM `categorias`
WHERE `categorias`.`id_categoria` = '1'
---
                                    <?php
                                    // Obtener la categoría del producto
                                    $categoriaModel = new \App\Models\CategoriaModel();
                                    $categoria = $categoriaModel->find($producto['id_categoria']);